#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//算术操作符
//int main()
//{
//	//+ - * /
//	//int a = 7 / 2;//除法求商
//	//printf("%d\n",a);
//	/*double b = 7.0 / 2;
//	printf("%lf\n",b);*/
//	int a = 7 % 2;//取模操作符两端只能是整数
//	printf("%d\n",a);
//	return 0;
//}

//位操作符（移动的是二进制位）
//整数：二进制形式有三种：原码、反码、补码
//正整数：原码、反码、补码 相同
//负整数：直接写出来的二进制是原码；原码的符号位不变，其他位按位取反得到反码；反码加1得到补码
//负数在内存中存储的是其对应的补码

//int main()
//{
//	/*int a = 14;
//	 00000000 00000000 00000000 00001110*/
//	int a = -1;
//	 //10000000 00000000 00000000 00000001  原码
//	 //11111111 11111111 11111111 11111110  反码
//	 //11111111 11111111 11111111 11111111  补码
//
//	int b = a >> 1;
//	printf("b=%d\n",b);
//
//	//int a = 5;
//	////00000000 00000000 00000000 00000101
//
//	//int b = a << 1;
//	//printf("%d\n",b);
//	return 0;
//}
//按位与、按位或、按位异或
//int main()
//{
//	int a = 5;
//	int b = 3;
//	printf("%d\n",a&b);
//	printf("%d\n", a|b);
//	printf("%d\n", a^b);
//	return 0;
//}

//例子:
//要求：不能创建临时变量（即第三个变量），实现两个数的交换
int main()
{
	int num1 = 5;
	int num2 = 7;
	num1 = num1^num2;
	num2 = num1^num2;
	num1 = num1^num2;
	printf("num1=%d\n",num1);
	printf("num2=%d\n", num2);
	return 0;
}


